# Homebrew Bundle file for macOS and Linux (with Homebrew installed)
# Managed by chezmoi - run `brew bundle --file=~/.config/homebrew/Brewfile` to install

tap "sdkman/tap"
tap "nikitabobko/tap"

brew "asdf"
brew "atuin"
brew "bat"
brew "btop"
brew "carapace"
brew "colima"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "dive"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "htop"
brew "jq"
brew "k9s"
brew "kanata"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "lima"
brew "lima-additional-guestagents"
brew "neovim"
brew "qemu"
brew "ripgrep"
brew "sdkman/tap/sdkman-cli"
brew "starship"
brew "tmux"
brew "watch"
brew "websocat"
brew "yazi"
brew "zoxide"

# Nerd Fonts (Hack and JetBrains Mono)
cask "font-hack-nerd-font" if OS.mac?
cask "font-jetbrains-mono-nerd-font" if OS.mac?

# Work computer only tools
cask "aerospace" if OS.mac?
cask "beekeeper-studio" if OS.mac?
cask "firefox" if OS.mac?
cask "ghostty" if OS.mac? # For Linux, see run_once_terminal.sh
cask "google-chrome" if OS.mac?
cask "karabiner-elements" if OS.mac?
cask "kitty" if OS.mac? # For Linux, see run_once_terminal.sh
cask "obsidian" if OS.mac? # For Linux, see run_once_install_obsidian.sh
cask "postman" if OS.mac?
cask "slack" if OS.mac?
cask "spotify" if OS.mac?
cask "whatsapp" if OS.mac?
